/*
                   _ooOoo_
                  o8888888o
                  88" . "88
                  (| -_- |)
                  O\  =  /O
               ____/`---'\____
             .'  \\|     |//  `.
            /  \\|||  :  |||//  \
           /  _||||| -:- |||||-  \
           |   | \\\  -  /// |   |
           | \_|  ''\---/''  |   |
           \  .-\__  `-`  ___/-. /
         ___`. .'  /--.--\  `. . __
      ."" '<  `.___\_<|>_/___.'  >'"".
     | | :  `- \`.;`\ _ /`;.`/ - ` : | |
     \  \ `-.   \_ __\ /__ _/   .-` /  /
======`-.____`-.___\_____/___.-`____.-'======
                   `=---='
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
         佛祖保佑       永无BUG
     佛曰:  
         写字楼里写字间，写字间里程序员；  
         程序人员写程序，又拿程序换酒钱。  
         酒醒只在网上坐，酒醉还来网下眠；  
         酒醉酒醒日复日，网上网下年复年。  
         但愿老死电脑间，不愿鞠躬老板前；  
         奔驰宝马贵者趣，公交自行程序员。  
         别人笑我忒疯癫，我笑自己命太贱；  
         不见满街漂亮妹，哪个归得程序员？
*/
#include <reg52.h>
#define XTAL_110592M  0
#define u8  unsigned char
#define u16 unsigned short
#define u32 unsigned long

u8 SegCode[10] = {0x3F, 0x06, 0x5B, 0x4F, 0x66, 0x6D, 0x7D, 0x07, 0x7F, 0x6F};  // 段选低电平有效

u8 Num1[4]={4,7,2,3};//改成自己的学号
u8 Num2[5]={'3','2','7','7','\n'};//改成自己的学号

u8 receiveData;  //接收缓存
u8 time =0;  //中断计数

/* 函数的声明*/
void delay( u16 t);

void main()
{
        u8 i=0;
        TMOD=0x21; //确定定时器方式
        PCON = 0x00;  //波特率不加倍为9600
        SCON = 0x50;  //工作在方式1
        
        #if XTAL_110592M
                TH1=0xFD;       //赋初值
                TL1=0xFD; 
                TH0=0xA6;
                TL0=0x00;
        #else
                TH1=0xFA;       //赋初值
                TL1=0xFA;
                TH0=0x4C;       //赋初值
                TL0=0x00;
        #endif
        TI =0;
        RI =0;
        TR1=1;
        TR0=1;
        IE = 0x9A;
        while(1)
        {
                if(receiveData=='1')
                {
                        for(i=0;i<4;i++)
                        {
                                P1&=0xf8; //1111 1000
                                P1|=i;   //xxxx x001
                                P2=SegCode[Num1[i]];
                                delay(1);
                                P2=0x00;//消隐
                        }
                }
                else
                {
                        P2=0x00; 
                }
        }
}

void delay( u16 t)
{
        u16 i,j;
        for(i=0;i<t;i++)
                for(j=0;j<1000;j++);
}
void TIM0_IRQHander(void) interrupt 1
{
        u8 i=0;
        TR0=0;
        #if XTAL_110592M
                TH0=0xA6;       //赋初值
//                TL0=0x00;  
        #else     
                TH0=0x4C;       //赋初值
//                TL0=0x00;
        #endif
        TR0=1;
        time++;
        if (time>=40)
        {
                time=0;
                for(i=0;i<5;i++)
                {
                        SBUF=Num2[i];
                        while(!TI);                 // 等待发送完成
                        TI=0;                   // 清除发送标志
                }
        }
}
void Usart() interrupt 4  //串口收发中断
{
            /*          接收中断        */
            TI=0;
            RI=0;           //置0，便于下一次的接收
            receiveData = SBUF;//将接收到的数据保存在 receiveData 中
}

//_ooOoo_  
//o8888888o  
//88" . "88  
//(| -_- |)  
// O\ = /O  
//___/`---'\____  
//.   ' \\| |// `.  
/// \\||| : |||//   
/// _||||| -:- |||||-   
//| | \\\ - /// | |  
//| \_| ''\---/'' | |  
//\ .-\__ `-` ___/-. /  
//___`. .' /--.--\ `. . __  
//."" '< `.___\_<|>_/___.' >'"".  
//| | : `- \`.;`\ _ /`;.`/ - ` : | |  
//\ \ `-. \_ __\ /__ _/ .-` / /  
//======`-.____`-.___\_____/___.-`____.-'======  
//`=---='  
//  
//         .............................................  
//          佛曰：bug泛滥，我已瘫痪！ 

